Catalogs/тсШаблоныПечатныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>тсШаблоныПечатныхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНаПримереДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКШаблонуWord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоТега</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецТега</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ИмяФайлаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайлаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрикрепляемогоФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИсходящихПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТегРегНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТегРегДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИсходящуюКорреспонденцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыИСвойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаДляПолученияЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДопСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектДопСвойства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоля</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПолейУЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПустоеЗначениеНеПробел</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВыбораТаблиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьИтоги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаТаблиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДополнительногоОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязьСоСтрокойПоПолю</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СинонимДополнительногоОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеТаблицы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКолонок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеСвойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Comment>Заголовок </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыПолейУЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыПолейУЭД</Name>
			<Comment>Хранит тип реквизитов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/тсШаблоныПечатныхДокументов/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекущийUIDСтрокиТаблицы;

&НаКлиенте
Процедура ПутьКШаблонуWordНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекФайл = Новый Файл (Элемент.ВыделенныйТекст);
	ТекКаталог = ТекФайл.Путь;      
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл шаблона Microsoft Word";
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.Каталог = ТекКаталог;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр =  "Шаблон документа (*.dot;*.dotx;*.ott)|*.dot;*.dotx;*.ott|";
	
	Если Диалог.Выбрать() Тогда
		Объект.ПутьКШаблонуWord = Диалог.ПолноеИмяФайла; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКШаблонуWordОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	Если УЭДСервер.ПроверитьСуществованияФайлаИлиКаталога(Объект.ПутьКШаблонуWord) = ложь Тогда
		Возврат;	
	КонецЕсли;
	
	
	СтандартнаяОбработка = Ложь; 	
	Word = Новый COMОбъект("Word.Application"); 
	Word.Visible = Ложь;
	
	ИмяФайла = Объект.ПутьКШаблонуWord;
	Попытка
		Документ = Word.Documents.Open(ИмяФайла); 		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;          
	Word.Visible = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНаПримереДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Если ТипЗнч(ВыбранноеЗначение) = Тип ("Тип") Тогда
	//	АнализируемыйТип = ВыбранноеЗначение;
	//Иначе
	//	АнализируемыйТип = ТипЗнч(ВыбранноеЗначение);
	//КонецЕсли;
	//
	//Если Не ЭлементыФормы.Назначение.Значение.СодержитТип(АнализируемыйТип) Тогда        		
	//	Если ТекущийТип <> Элемент.Значение Тогда
	//		Ответ = Вопрос("Обнаружена смена Назначения. Будут очищены пути к реквизитам во всех таблицах. Продолжить?", РежимДиалогаВопрос.ОКОтмена);
	//		Если Ответ = КодВозвратаДиалога.Отмена Тогда
	//			СтандартнаяОбработка = Ложь;
	//			Возврат;  
	//		Иначе
	//			//ОчисткаЗначений(, Истина); 
	//		КонецЕсли; 
	//	КонецЕсли;
		
	Объект.ПоказыватьНаПримереДокумента = ВыбранноеЗначение;
		
	//	Если Не ВыбранноеЗначение = Неопределено Тогда
	//		
	//		тсРаботаСДокументами.ПривестиНазначениеКНаПримере(ВыбранноеЗначение, ЭлементыФормы.Назначение);	
	//		ЗаполнитьСписокТЧ(ВыбранноеЗначение);
	//		
	//	КонецЕсли;     		
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНаПримереДокументаОчистка(Элемент, СтандартнаяОбработка)
	Элементы.ПоказыватьНаПримереДокумента.ВыбиратьТип = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыИСвойстваЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтруктураПараметров = ОткрытьФормуВыбораРеквизитов(Объект.ПоказыватьНаПримереДокумента,ЭтаФорма,,,
	//		Элементы.РеквизитыИСвойства.ТекущиеДанные);	
	//		
	//Чуров
	ВызывающийДокумент = Объект.ПоказыватьНаПримереДокумента;
	ОтфильтрТипов = Неопределено;

	Если ВызывающийДокумент = Неопределено Тогда
		Сообщить("Поле ""На примере документа"" должно быть заполнено!", СтатусСообщения.Внимание); 
		Возврат;	
	КонецЕсли; 
			
	Форма = ПолучитьФорму("Справочник.тсШаблоныПечатныхДокументов.Форма.ФормаВыбораРеквизитовУпр");
	Форма.ВладелецФормы = ЭтаФорма;
	Если ЗначениеЗаполнено(ОтФильтрТипов) Тогда	
		ЗаголовогПлюс = " по типу """ + Строка(ОтФильтрТипов) + """";	
	КонецЕсли; 
	форма.Заголовок = "Выбор реквизитов" + ЗаголовогПлюс;
	Форма.ЗакрыватьПриЗакрытииВладельца = Истина;
	Форма.Документ = ВызывающийДокумент;
	Форма.ОтФильтрТипов = ОтФильтрТипов;
	Форма.Элементы.ТабМетаданныеДерево.ПодчиненныеЭлементы.тзМетаданныеЗначение.Видимость = Истина;
	
	ОткрытьФорму(Форма);
	//--
	
	
	//ТекущиеДанные = Элементы.РеквизитыИСвойства.ТекущиеДанные;
	//Если Не СтруктураПараметров = Неопределено Тогда
	//	//ТекущиеДанные.Значение 	= СтруктураПараметров.Синоним;
	//	//МассивХранилища = ОбъектыСервер.РазыменоватьСсылку(СтруктураПараметров, "Хранилище.Получить()"); 	
	//	//
	//	//ТекущиеДанные.КодДопСвойства = СтруктураПараметров.КодДопСвойства;
	//	//ТекущиеДанные.ОбъектДопСвойства = СтруктураПараметров.ОбъектДопСвойства;
	//	//
	//	//Список = Новый СписокЗначений;
	//	//Для Каждого Стр Из МассивХранилища Цикл
	//	//	Список.Добавить(Стр);
	//	//КонецЦикла;
	//	//ТекущиеДанные.Хранилище1 = Список;
	//	//РеквизитВЗначение(ТекущиеДанные.НомерСтроки, СтруктураПараметров.Хранилище);
	//	
	//	ТекущиеДанные.Значение 	= СтруктураПараметров.Синоним;
	//	МассивДанных = СтруктураПараметров.МассивДанных; 	
	//	
	//	ТекущиеДанные.КодДопСвойства = СтруктураПараметров.КодДопСвойства;
	//	ТекущиеДанные.ОбъектДопСвойства = СтруктураПараметров.ОбъектДопСвойства;
	//	
	//	Список = Новый СписокЗначений;
	//	Для Каждого Стр Из МассивДанных Цикл
	//		Список.Добавить(Стр);
	//	КонецЦикла;
	//	ТекущиеДанные.Хранилище1 = Список;
	//	ЗаписатьДанныеВСтрокуХранилище(ТекущиеДанные.НомерСтроки, МассивДанных);	
	//КонецЕсли;
КонецПроцедуры

//Чуров++
&НаКлиенте
Процедура РеквизитыИСвойстваЗначениеЗаполнение(СтруктураПараметров) 
	
	ТекущиеДанные = Элементы.РеквизитыИСвойства.ТекущиеДанные;
	Если Не СтруктураПараметров = Неопределено Тогда	
		ТекущиеДанные.Значение 	= СтруктураПараметров.Синоним;
		МассивДанных = СтруктураПараметров.МассивДанных; 	
		
		ТекущиеДанные.КодДопСвойства = СтруктураПараметров.КодДопСвойства;
		ТекущиеДанные.ОбъектДопСвойства = СтруктураПараметров.ОбъектДопСвойства;
		
		Список = Новый СписокЗначений;
		Для Каждого Стр Из МассивДанных Цикл
			Список.Добавить(Стр);
		КонецЦикла;
		ТекущиеДанные.Хранилище1 = Список;
		ЗаписатьДанныеВСтрокуХранилище(ТекущиеДанные.НомерСтроки, МассивДанных);	
	КонецЕсли;
КонецПроцедуры
//Чуров--


&НаСервере
Процедура ЗаписатьДанныеВСтрокуХранилище(НомерСтроки, МассивДанных)
	
	Рекв = РеквизитФормыВЗначение("Объект");
	Рекв.Записать_СтрокаХранилище(НомерСтроки, МассивДанных);
	ЗначениеВРеквизитФормы(Рекв, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура _РеквизитВЗначение(НомерСтроки, Хранилище)
	Рекв = РеквизитФормыВЗначение("Объект");
	Рекв.ЗаписатьХранилищеЗначений(НомерСтроки, Хранилище);
	ЗначениеВРеквизитФормы(Рекв, "Объект");
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуВыбораРеквизитов(ВызывающийДокумент, ФормаВладелец = Неопределено,
		ПоказыватьЗначение = Истина, ОтФильтрТипов = Неопределено, ТекущиеДанныеПередОткрытием = Неопределено) Экспорт	
		
	Если ВызывающийДокумент = Неопределено Тогда
		Сообщить("Поле ""На примере документа"" должно быть заполнено!", СтатусСообщения.Внимание); 
		Возврат Неопределено;	
	КонецЕсли; 
	
	Форма = ПолучитьФорму("Справочник.тсШаблоныПечатныхДокументов.Форма.ФормаВыбораРеквизитовУпр");
	Форма.ВладелецФормы = ФормаВладелец;
	Если ЗначениеЗаполнено(ОтФильтрТипов) Тогда	
		ЗаголовогПлюс = " по типу """ + Строка(ОтФильтрТипов) + """";	
	КонецЕсли; 
	форма.Заголовок = "Выбор реквизитов" + ЗаголовогПлюс;
	Форма.ЗакрыватьПриЗакрытииВладельца = Истина;
	Форма.Документ = ВызывающийДокумент;
	Форма.ОтФильтрТипов = ОтФильтрТипов;
	Форма.Элементы.ТабМетаданныеДерево.ПодчиненныеЭлементы.тзМетаданныеЗначение.Видимость = ПоказыватьЗначение;	
	 	
	//Если Не  ТекущиеДанныеПередОткрытием = Неопределено Тогда
	//	Форма.ХранилищеЗначРекв = ТекущиеДанныеПередОткрытием.Хранилище;	
	//КонецЕсли;
		
	СтруктураПараметров = Форма.ОткрытьМодально();
	
	Возврат СтруктураПараметров;
	
КонецФункции // ()

&НаКлиенте
Процедура ТаблицаТаблицПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Элементы.ТаблицаВыбораТаблиц.ТекущиеДанные = Неопределено Тогда
		Отказ=Истина;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаблицПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
		
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Поле = "<>";	
		Элемент.ТекущиеДанные.UID = Элементы.ТаблицаВыбораТаблиц.ТекущиеДанные.UID;
		Элемент.ТекущиеДанные.Используется = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораТаблицПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда		
		Элемент.ТекущиеДанные.UID = Строка(Новый УникальныйИдентификатор);
		Элемент.ТекущиеДанные.ПолеТаблицы = "<>";
		Элемент.ТекущиеДанные.Используется = Истина;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораТаблицПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("UID", Элемент.ТекущиеДанные.UID); 
	//ОтборСтрокоПоUID = 
	Элементы.ТаблицаТаблиц.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	//ОтборСтрокоПоUID.UID.Установить(Элемент.ТекущиеДанные.UID);
	Элементы.ТаблицаТаблиц.Обновить();
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаблицЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаТаблиц.ТекущиеДанные;
	МассивКолонокФункции = Новый Массив;
	Элементы.ТаблицаТаблицЗначение.СписокВыбора.Очистить();
	ФункцияСсылка = Элементы.ТаблицаВыбораТаблиц.ТекущиеДанные.Функция; 
	СформироватьСписокКолонокФункции(ФункцияСсылка,МассивКолонокФункции);
	
	Для каждого Колонка Из МассивКолонокФункции Цикл
		Элементы.ТаблицаТаблицЗначение.СписокВыбора.Добавить(Колонка);
	КонецЦикла; 

	
	//
	//Для каждого Колонка Из Элементы.ТаблицаВыбораТаблиц.ТекущиеДанные.Функция.ВозвращаемыеКолонки Цикл
	//	Элементы.ТаблицаТаблицЗначение.СписокВыбора.Добавить(Колонка.Наименование);
	//КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокКолонокФункции(Ф,Массив)
	
	Для каждого Колонка Из ф.ВозвращаемыеКолонки Цикл
		Массив.Добавить(Колонка.Наименование);
	КонецЦикла; 
	
КонецПроцедуры


&НаСервере
Функция СформироватьНазваниеТЧ(ВызывающийДокумент, Хранилище, ДокументОснование = Неопределено) Экспорт
	
	//Хранилище = Новый ХранилищеЗначения(,);
	//СтруктураДерева = Хранилище.Получить();
	СтруктураДерева = Неопределено;
	ДокументВложенный = ВызывающийДокумент;				
					
	// Формируем путь.
	ГраницаМассива = СтруктураДерева.ВГраница();
	Счет = 0;
	Для Счет = 0 По ГраницаМассива Цикл
		НомерСКонца = ГраницаМассива - Счет;
			
		Если ГраницаМассива = Счет Тогда
			ДокументОснование = Неопределено;
			ДокументОснование = ДокументВложенный; 		
		КонецЕсли;      	
		
		СтрокаМассива = СтруктураДерева[НомерСКонца];
		ДокументВложенный = ДокументВложенный[СтрокаМассива];

	КонецЦикла;
	Значение = ДокументВложенный;
	 
	Возврат Значение;
КонецФункции // СформироватьНазваниеТЧ()

&НаКлиенте
Процедура РеквизитыИСвойстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Поле = "<>";	
		Элемент.ТекущиеДанные.Используется = Истина;
		Элемент.ТекущиеДанные.ТипПоля = ПредопределенноеЗначение("Перечисление.ТипыПолейУЭД.Реквизит");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыИСвойстваПередНачаломИзменения(Элемент, Отказ)
	Если Элементы.РеквизитыИСвойства.ТекущиеДанные.ТипПоля = ПредопределенноеЗначение(
			"Перечисление.ТипыПолейУЭД.Реквизит") Тогда 
		Элементы.РеквизитыИСвойстваЗначение.РедактированиеТекста = Ложь;
		Элементы.РеквизитыИСвойстваЗначение.КнопкаВыбора = Истина;
	ИначеЕсли Элементы.РеквизитыИСвойства.ТекущиеДанные.ТипПоля = ПредопределенноеЗначение(
			"Перечисление.ТипыПолейУЭД.Текст") Тогда
		Элементы.РеквизитыИСвойстваЗначение.РедактированиеТекста = Истина;
		Элементы.РеквизитыИСвойстваЗначение.КнопкаВыбора = Ложь;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыИСвойстваПриАктивизацииЯчейки(Элемент)
	Если Элементы.РеквизитыИСвойства.ТекущиеДанные <> Неопределено Тогда
		Если Элементы.РеквизитыИСвойства.ТекущиеДанные.ТипПоля = ПредопределенноеЗначение(
				"Перечисление.ТипыПолейУЭД.Реквизит") Тогда 
			Элементы.РеквизитыИСвойстваЗначение.РедактированиеТекста = Ложь;
			Элементы.РеквизитыИСвойстваЗначение.КнопкаВыбора = Истина;
		ИначеЕсли Элементы.РеквизитыИСвойства.ТекущиеДанные.ТипПоля = ПредопределенноеЗначение(
				"Перечисление.ТипыПолейУЭД.Текст") Тогда
			Элементы.РеквизитыИСвойстваЗначение.РедактированиеТекста = Истина;
			Элементы.РеквизитыИСвойстваЗначение.КнопкаВыбора = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьИндикаторЗагрузкиШаблона();
	Элементы.ГруппаИсходящаяКорреспонденция.Видимость = Константы.АвторегистрацияПечатныхФорм.Получить();
	Элементы.РегистрироватьИсходящуюКорреспонденцию.Видимость = Константы.АвторегистрацияПечатныхФорм.Получить();
	Элементы.ГруппаИсходящаяКорреспонденция.Доступность = Объект.РегистрироватьИсходящуюКорреспонденцию;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзШаблона(Команда)
	
	
	СтрокаФайл = Объект.Шаблон;
	СтрокаРасширение = Объект.РасширениеФайлаШаблона;
	
	ДвоичныйАдрес =  УЭДСервер.ПолучитьФайлИзДвоичныхДанных(СтрокаФайл, СтрокаРасширение);
	
	#Если НЕ ВебКлиент Тогда
		ИмяВремФайла = ПолучитьИмяВременногоФайла(СтрокаРасширение);
		ДвоичныйАдрес.Записать(ИмяВремФайла);
		
		ТекущийДок = ОбъектыСервер.ПолучитьЗначениеКонстанты("ТипШаблонаДляПечати");
		Если Строка(ТекущийДок) = "Word" Тогда
			
			// Получием текст из Word
			Ворд = Новый COMОбъект("Word.Application");
			//--Ворд.Documents.Open(Объект.ПутьКШаблонуWord,,Истина);
			Ворд.Documents.Open(ИмяВремФайла,,Истина);
			Ворд.Selection.WholeStory();
			ТекстВорда = Ворд.Selection.Text;   
			Ворд.Quit();	
			Ворд = "";
			// Получаем все теги из текста и помещаем в СписокЗначений
			ТекстВорда = СокрЛП(ТекстВорда);
			СписокТегов = Новый СписокЗначений;
			Пока СтрДлина(ТекстВорда) > 0 Цикл
				НачТега = Найти(ТекстВорда, Объект.НачалоТега);
				КонТега = Найти(ТекстВорда, Объект.КонецТега);
				Если НачТега = 0  И КонТега = 0 Тогда
					Прервать;	
				КонецЕсли;
				ИмяТега = Сред(ТекстВорда, НачТега, КонТега - НачТега + 1); 
				ТекстВорда =  Сред(ТекстВорда, КонТега + 1);
				Если СписокТегов.НайтиПоЗначению(ИмяТега) = Неопределено Тогда
					СписокТегов.Добавить(ИмяТега);	
				КонецЕсли;
			КонецЦикла;
			// В цикле по СЗ ищем значения в ТЧ и добавляем новые, если их нету.
			РеквизитыОбъект = Объект.РеквизитыИСвойства;
			Для Каждого Эл Из СписокТегов Цикл
				ПараметрыОтбора = Новый Структура("Поле", Эл.Значение);	
				НайденныеТеги = РеквизитыОбъект.НайтиСтроки(ПараметрыОтбора); 
				Если НайденныеТеги.Количество() = 0 Тогда
					Нов              = РеквизитыОбъект.Добавить();
					Нов.Используется = Истина;
					Нов.Поле         = Эл.Значение;   	
					Нов.ТипПоля      = ПредопределенноеЗначение("Перечисление.ТипыПолейУЭД.Реквизит");				
				КонецЕсли;	
			КонецЦикла;	
		ИначеЕсли Строка(ТекущийДок) = "OpenOffice" Тогда
			ИзвлечениеТекстаИзФайла = Новый ИзвлечениеТекста(ИмяВремФайла);
			ТекстОпенОффис = ИзвлечениеТекстаИзФайла.ПолучитьТекст();
			ТекстОпенОффис = СокрЛП(ТекстОпенОффис);
			СписокТегов = Новый СписокЗначений;
			Пока СтрДлина(ТекстОпенОффис) > 0 Цикл
				НачТега = Найти(ТекстОпенОффис, Объект.НачалоТега);
				КонТега = Найти(ТекстОпенОффис, Объект.КонецТега);
				Если НачТега = 0  И КонТега = 0 Тогда
					Прервать;	
				КонецЕсли;
				ИмяТега = Сред(ТекстОпенОффис, НачТега, КонТега - НачТега + 1); 
				ТекстОпенОффис =  Сред(ТекстОпенОффис, КонТега + 1);
				Если СписокТегов.НайтиПоЗначению(ИмяТега) = Неопределено Тогда
					СписокТегов.Добавить(ИмяТега);	
				КонецЕсли;
			КонецЦикла;
			// В цикле по СЗ ищем значения в ТЧ и добавляем новые, если их нету.
			РеквизитыОбъект = Объект.РеквизитыИСвойства;
			Для Каждого Эл Из СписокТегов Цикл
				ПараметрыОтбора = Новый Структура("Поле", Эл.Значение);	
				НайденныеТеги = РеквизитыОбъект.НайтиСтроки(ПараметрыОтбора); 
				Если НайденныеТеги.Количество() = 0 Тогда
					Нов              = РеквизитыОбъект.Добавить();
					Нов.Используется = Истина;
					Нов.Поле         = Эл.Значение;   	
					Нов.ТипПоля      = ПредопределенноеЗначение("Перечисление.ТипыПолейУЭД.Реквизит");				
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
		
	#Иначе
		Файл = Новый Файл(КаталогВременныхФайлов() + ПолучитьРазделительПути() + ТекущаяДата()+ СтрокаРасширение);
		ФайлИмя = Файл.ПолноеИмя;
		ДвоичныйАдрес.Записать(ФайлИмя);
		// Получием текст из Word
		Ворд = Новый COMОбъект("Word.Application");
		//--Ворд.Documents.Open(Объект.ПутьКШаблонуWord,,Истина);
		Ворд.Documents.Open(ФайлИмя,,Истина);
		Ворд.Selection.WholeStory();
		ТекстВорда = Ворд.Selection.Text;   
		Ворд.Quit();	
		Ворд = "";
		// Получаем все теги из текста и помещаем в СписокЗначений
		ТекстВорда = СокрЛП(ТекстВорда);
		СписокТегов = Новый СписокЗначений;
		Пока СтрДлина(ТекстВорда) > 0 Цикл
			НачТега = Найти(ТекстВорда, Объект.НачалоТега);
			КонТега = Найти(ТекстВорда, Объект.КонецТега);
			Если НачТега = 0  И КонТега = 0 Тогда
				Прервать;	
			КонецЕсли;
			ИмяТега = Сред(ТекстВорда, НачТега, КонТега - НачТега + 1); 
			ТекстВорда =  Сред(ТекстВорда, КонТега + 1);
			Если СписокТегов.НайтиПоЗначению(ИмяТега) = Неопределено Тогда
				СписокТегов.Добавить(ИмяТега);	
			КонецЕсли;
		КонецЦикла;
		// В цикле по СЗ ищем значения в ТЧ и добавляем новые, если их нету.
		РеквизитыОбъект = Объект.РеквизитыИСвойства;
		Для Каждого Эл Из СписокТегов Цикл
			ПараметрыОтбора = Новый Структура("Поле", Эл.Значение);	
			НайденныеТеги = РеквизитыОбъект.НайтиСтроки(ПараметрыОтбора); 
			Если НайденныеТеги.Количество() = 0 Тогда
				Нов              = РеквизитыОбъект.Добавить();
				Нов.Используется = Истина;
				Нов.Поле         = Эл.Значение;   	
				Нов.ТипПоля      = ПредопределенноеЗначение("Перечисление.ТипыПолейУЭД.Реквизит");				
			КонецЕсли;	
		КонецЦикла;	
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШаблон(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл шаблона Microsoft Word";
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр =  "Шаблон документа (*.dot;*.dotx;*.ott)|*.dot;*.dotx;*.ott|";
	
	Попытка
		Тест_ = Тест;
	Исключение
		Тест_ = "";
	КонецПопытки;
	
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьШаблонЗавершение", ЭтаФорма, Новый Структура("Диалог, Тест_", Диалог, Тест_)));
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШаблонЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Диалог = ДополнительныеПараметры.Диалог;
	Тест_ = ДополнительныеПараметры.Тест_;
	
	Если Тест_ <> "" ИЛИ (ВыбранныеФайлы <> Неопределено) Тогда
		Путь = ?(Тест_ <> "", Тест_, Диалог.ПолноеИмяФайла);	
		//ДвоичныйАдрес = Новый ДвоичныеДанные(Путь);
		Файл = Новый Файл(Путь);
		ДопПараметры = Новый Структура("Файл", Файл);
		//Файл = Новый Файл(Путь);
		//Расширение = Файл.Расширение;
		//НачатьСозданиеДвоичныхДанныхИзФайла(Новый ОписаниеОповещения("КонецСозданияДД",ЭтаФорма,ДопПараметры),Путь);
		НачатьСозданиеДвоичныхДанныхИзФайла(Новый ОписаниеОповещения("КонецСозданияДД",ЭтаФорма,ДопПараметры),Путь);
		//ЗагрузитьШаблон_НаСервере(ДвоичныйАдрес, Расширение);	
		//УстановитьИндикаторЗагрузкиШаблона();
		//ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ЗагрузитьШаблон_НаСервере(ДвоичныйАдрес, Расширение)
	ДанныеСтрока = ЗначениеВСтрокуВнутр(ДвоичныйАдрес);
	Объект.Шаблон = ДанныеСтрока;
	Объект.РасширениеФайлаШаблона = Расширение;	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОткрытьШаблон(Команда)
#Если НЕ ВебКлиент Тогда
		ДвоичныйАдрес = ПолучитьДвоичныеДанные(Объект.Шаблон);	
		ИмяВремФайла = ПолучитьИмяВременногоФайла(Объект.РасширениеФайлаШаблона);
		ДвоичныйАдрес.Записать(ИмяВремФайла);
		
		ТекущийДок = ОбъектыСервер.ПолучитьЗначениеКонстанты("ТипШаблонаДляПечати");
		Если Строка(ТекущийДок) = "Word" Тогда
			//ЗапуститьПриложение(ИмяВремФайла);
			Word = Новый COMОбъект("Word.Application"); 
			Word.Visible = Ложь;
			
			ИмяФайла = ИмяВремФайла;
			Попытка
				Документ = Word.Documents.Open(ИмяФайла); 		
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;          
			Word.Visible = Истина;
			//НачатьПолучениеКаталогаВременныхФайлов (Новый ОписаниеОповещения("КонецПолученияКаталогаВФ",ЭтаФорма)); Для Теста Веба
		ИначеЕсли Строка(ТекущийДок) = "OpenOffice" Тогда
			ИмяФайла = ИмяВремФайла;
			ServiceManager = Новый COMОбъект("com.sun.star.ServiceManager");
			Desktop        = ServiceManager.createInstance("com.sun.star.frame.Desktop");
			ОбъектОО = Новый COMОбъект("MSScriptControl.ScriptControl");
			ОбъектОО.Language="javascript";
			ОбъектОО.Eval("Args=new Array()");
			Args = ОбъектОО.Eval("Args");
			ОбъектОО.AddObject("ServiceManager", ServiceManager);
			
			PropertyValue = ServiceManager.Bridge_GetStruct("com.sun.star.beans.PropertyValue");
			PropertyValue.Name = "Hidden";
			PropertyValue.Value = Ложь;
			Args = Новый COMSafeArray("VT_VARIANT", 1);
			Args.SetValue(0, PropertyValue);
			origDocument = Desktop.LoadComponentFromURL(ПреобразоватьВURL(ИмяФайла), "_blank", 0, Args);
			//Попытка
			//	origDocument.Open();
			//Исключение
			//	Сообщить(ОписаниеОшибки());
			//	Возврат;
			//КонецПопытки;   

			//ОткрытиеШаблонаОО
		КонецЕсли;
	#Иначе
		//ДвоичныйАдрес = ПолучитьДвоичныеДанные(Объект.Шаблон);
		НачатьПолучениеКаталогаВременныхФайлов (Новый ОписаниеОповещения("КонецПолученияКаталогаВФ",ЭтаФорма));
		//Файл = Новый Файл(КаталогВременныхФайлов() + ПолучитьРазделительПути() + ТекущаяДата()+ Объект.РасширениеФайлаШаблона);
		//Файл = Новый Файл(строка(ТекущаяДата())+ Объект.РасширениеФайлаШаблона);
		//ФайлИмя = Файл.ПолноеИмя;
		//ДвоичныйАдрес.Записать(ФайлИмя);
		//ДвоичныйАдрес.НачатьЗапись(Новый ОписаниеОповещения("КонецЗаписиДД",этаформа),ФайлИмя);
		//Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
		//НачатьЗапускПриложения(Оповещение,ФайлИмя,,Истина);
		//ЗапуститьПриложение(ИмяВремФайла);
		//Word = ПолучитьCOMОбъект(,"Word.Application");
		//Word = Новый COMОбъект("Word.Application"); 
		//Word.Visible = Ложь;
		//
		//ИмяФайла = ФайлИмя;
		//Попытка
		//	Документ = Word.Documents.Open(ИмяФайла); 		
		//Исключение
		//	Сообщить(ОписаниеОшибки());
		//	Возврат;
		//КонецПопытки;          
		//Word.Visible = Истина;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КонецПолученияКаталогаВФ(КаталогВФ, ДопПарам) Экспорт
	ДвоичныйАдрес = ПолучитьДвоичныеДанные(Объект.Шаблон);
	ДатаДляИмениФайла = Строка(ТекущаяДата());
	ДатаДляИмениФайла = СтрЗаменить(ДатаДляИмениФайла,":","");
	ДатаДляИмениФайла = СтрЗаменить(ДатаДляИмениФайла,".","");
	ДатаДляИмениФайла = СтрЗаменить(ДатаДляИмениФайла," ","");
	Файл = Новый Файл(КаталогВФ + ПолучитьРазделительПути() + строка(ДатаДляИмениФайла)+ Объект.РасширениеФайлаШаблона);// + ПолучитьРазделительПути()
	ФайлИмя = Файл.ПолноеИмя;
	ДопПарам = Новый Структура("ФайлИмя",ФайлИмя);
	ДвоичныйАдрес.НачатьЗапись(Новый ОписаниеОповещения("КонецЗаписиДД",этаформа,ДопПарам),ФайлИмя);
	//Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
	//НачатьЗапускПриложения(Оповещение,ФайлИмя,,Истина);
	//ДвоичныеДанные = новый ДвоичныеДанные();
КонецПроцедуры

&НаКлиенте
Процедура КонецЗаписиДД(ДопПарам) Экспорт
	ФайлИмя = ДопПарам.ФайлИмя;
	ЗапуститьПриложение(ФайлИмя);
	//Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
	//НачатьЗапускПриложения(Оповещение,ФайлИмя,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт
 //Заглушка
КонецПроцедуры

&НаКлиенте
Процедура КонецСозданияДД(ДвоичныйАдрес, ДопПараметры) Экспорт
	Файл = ДопПараметры.Файл;
	Расширение = Файл.Расширение;
	ЗагрузитьШаблон_НаСервере(ДвоичныйАдрес, Расширение);	
	УстановитьИндикаторЗагрузкиШаблона();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры


&НаСервере
Функция ПолучитьДвоичныеДанные(АдресШаблона)
	
	ДвоичныйАдрес = ЗначениеИзСтрокиВнутр(АдресШаблона);	
	Возврат ДвоичныйАдрес;
	
КонецФункции

&НаСервере
Процедура УстановитьИндикаторЗагрузкиШаблона()
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		Элементы.Декорация_ШаблонЗагружен.Видимость = Истина;
		Элементы.Декорация_ШаблонНеЗагружен.Видимость = Ложь;
	Иначе
		Элементы.Декорация_ШаблонЗагружен.Видимость = Ложь;
		Элементы.Декорация_ШаблонНеЗагружен.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РегистрироватьИсходящуюКорреспонденциюПриИзменении(Элемент)
	Элементы.ГруппаИсходящаяКорреспонденция.Доступность = Объект.РегистрироватьИсходящуюКорреспонденцию;
КонецПроцедуры

//Чуров++
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ШаблоныПечФормВыборРеквизита" Тогда
		РеквизитыИСвойстваЗначениеЗаполнение(Параметр);	
	КонецЕсли;
КонецПроцедуры
//--
&НаКлиенте
Функция ПреобразоватьВURL(ИмяФайла)   
	Возврат "file:///" + СтрЗаменить(ИмяФайла, "\", "/"); 
КонецФункции
